movingBlock/movingBlock_St0.7/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      dynamicMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh	dynamicMotionSolverFvMesh;
motionSolver	solidBody;

//motionSolverLibs ("libfvMotionSolvers.so");

//motionSolver solidBody;

solidBodyMotionFunction oscillatingLinearMotion;
oscillatingLinearMotionCoeffs
{
    //oscillatingLinearMotionCoeffs
    //{
        solidBodyMotionFunction oscillatingLinearMotion;
	amplitude	(0.0 1.0 0.0);
	omega		2.1991149; //St=0.7; f=0.35
    //}
}



// ************************************************************************* //
